Revit 2024 API
MechanicalUtils Class
 General utility methods in the Autodesk Revit MEP product.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class MechanicalUtils
Visual Basic
Public NotInheritable Class MechanicalUtils
Visual C++
public ref class MechanicalUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.MechanicalUtils
See Also
MechanicalUtils Members
Autodesk.Revit.DB.Mechanical Namespace